--------------------------------------------------------
--  File created - четверг-Октябрь-22-2015   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for Table ЗАКАЗ
--------------------------------------------------------

CREATE TABLE  "ЗАКАЗ" 
   ("КОДКЛИЕНТА" int NOT NULL, 
    "НОМЕРЗАКАЗА" INT PRIMARY KEY, 
    "КОДКУРЬЕРА" INT, 
    "ДАТАЗАКАЗА" DATE DEFAULT GETDATE(), 
    "СРОКПОСТАВКИ" DATE DEFAULT GETDATE() + 7,
    "СОСТОЯНИЕ" CHAR(15) DEFAULT 'РЕЗЕРВ'     
   );
--------------------------------------------------------
--  DDL for Table КЛИЕНТ
--------------------------------------------------------

  CREATE TABLE "КЛИЕНТ" 
   ("КОДКЛИЕНТА" INT PRIMARY KEY,
    "НАИМЕНОВАНИЕ" NVARCHAR(50),
    "АДРЕС" NVARCHAR(50), 
    "КОНТАКТ" NVARCHAR(50)
   );
--------------------------------------------------------
--  DDL for Table КУРЬЕР
--------------------------------------------------------

  CREATE TABLE "КУРЬЕР" 
   ("КОДКУРЬЕРА" INT PRIMARY KEY, 
    "ФИО" NVARCHAR(50), 
    "КОНТАКТ" NVARCHAR(100)
   );
--------------------------------------------------------
--  DDL for Table ПОСТАВЩИК
--------------------------------------------------------

  CREATE TABLE "ПОСТАВЩИК" 
   ("КОД_ПОСТАВЩИКА" INT PRIMARY KEY, 
    "НАИМЕНОВАНИЕ" NVARCHAR(50), 
    "АДРЕС" NVARCHAR(100), 
    "КОНТАКТ" NVARCHAR(50)
   );
--------------------------------------------------------
--  DDL for Table СКЛАД
--------------------------------------------------------

  CREATE TABLE "СКЛАД" 
   ("НОМ_СКЛАДА" INT PRIMARY KEY, 
    "РАСПОЛОЖЕНИЕ" NVARCHAR(100), 
    "ЕМКОСТЬ" INT
   );
--------------------------------------------------------
--  DDL for Table ТОВАР
--------------------------------------------------------

  CREATE TABLE  "ТОВАР" 
   ("ЗАВ_НОМ" INT PRIMARY KEY, 
    "КОД_ПОСТАВЩИКА" INT NOT NULL, 
    "НОМ_СКЛАДА" INT, 
    "НОМЕРЗАКАЗА" INT, 
    "НАИМЕНОВАНИЕ" NVARCHAR(100) NOT NULL, 
    "ЦЕНА" MONEY, 
    "ОПИСАНИЕ" NVARCHAR(MAX), 
    "МАРКА" NVARCHAR(50),    
     CHECK (ЦЕНА > 0)
   );
--------------------------------------------------------
--  Constraints for Table ЗАКАЗ
--------------------------------------------------------

  --ALTER TABLE "ЗАКАЗ" ADD CONSTRAINT "XPKЗАКАЗ" PRIMARY KEY ("НОМЕРЗАКАЗА");
  --ALTER TABLE "ЗАКАЗ" MODIFY ("КОДКЛИЕНТА" NOT NULL ENABLE);
--------------------------------------------------------
--  Constraints for Table КЛИЕНТ
--------------------------------------------------------

--  ALTER TABLE "КЛИЕНТ" ADD CONSTRAINT "XPKКЛИЕНТ" PRIMARY KEY ("КОДКЛИЕНТА");
----------------------------------------------------------
----  Constraints for Table КУРЬЕР
----------------------------------------------------------

--  ALTER TABLE "КУРЬЕР" ADD CONSTRAINT "XPKКУРЬЕР" PRIMARY KEY ("КОДКУРЬЕРА");
----------------------------------------------------------
----  Constraints for Table ПОСТАВЩИК
----------------------------------------------------------

--  ALTER TABLE "ПОСТАВЩИК" ADD CONSTRAINT "XPKПОСТАВЩИК" PRIMARY KEY ("КОД_ПОСТАВЩИКА");
----------------------------------------------------------
----  Constraints for Table СКЛАД
----------------------------------------------------------

--  ALTER TABLE "СКЛАД" ADD CONSTRAINT "XPKСКЛАД" PRIMARY KEY ("НОМ_СКЛАДА");
--------------------------------------------------------
--  Constraints for Table ТОВАР
--------------------------------------------------------

--  ALTER TABLE "ТОВАР" ADD CONSTRAINT "XPKТОВАР" PRIMARY KEY ("ЗАВ_НОМ");
--  ALTER TABLE "ТОВАР" MODIFY ("НАИМЕНОВАНИЕ" NOT NULL ENABLE);
--  ALTER TABLE "ТОВАР" MODIFY ("КОД_ПОСТАВЩИКА" NOT NULL ENABLE);

--------------------------------------------------------
--  Ref Constraints for Table ЗАКАЗ
--------------------------------------------------------

  ALTER TABLE "ЗАКАЗ" ADD CONSTRAINT "XIF1ЗАКАЗ" FOREIGN KEY ("КОДКЛИЕНТА")
      REFERENCES "КЛИЕНТ" ("КОДКЛИЕНТА");
  ALTER TABLE "ЗАКАЗ" ADD CONSTRAINT "XIF2ЗАКАЗ" FOREIGN KEY ("КОДКУРЬЕРА")
      REFERENCES "КУРЬЕР" ("КОДКУРЬЕРА");
--------------------------------------------------------
--  Ref Constraints for Table ТОВАР
--------------------------------------------------------

  ALTER TABLE "ТОВАР" ADD CONSTRAINT "XIF1ТОВАР" FOREIGN KEY ("КОД_ПОСТАВЩИКА")
      REFERENCES "ПОСТАВЩИК" ("КОД_ПОСТАВЩИКА");
  ALTER TABLE "ТОВАР" ADD CONSTRAINT "XIF2ТОВАР" FOREIGN KEY ("НОМ_СКЛАДА")
      REFERENCES "СКЛАД" ("НОМ_СКЛАДА");
  ALTER TABLE "ТОВАР" ADD CONSTRAINT "XIF3ТОВАР" FOREIGN KEY ("НОМЕРЗАКАЗА")
      REFERENCES "ЗАКАЗ" ("НОМЕРЗАКАЗА");
